// 正则


/**
 * ip：校验ipv4
 * email：邮箱
 * phone：手机号码
 * password_1：密码以字母开头，长度在6~18之间，只能包含字母、数字和下划线
 * password_2：密码必须包含大小写字母和数字的组合，不能使用特殊字符，长度在 8-10 之间
 * password_3：密码必须包含大小写字母和数字的组合，可以使用特殊字符，长度在8-10之间
 */
 export default {
    ip: /((?:(?:25[0-5]|2[0-4]\d|[01]?\d?\d)\.){3}(?:25[0-5]|2[0-4]\d|[01]?\d?\d))/,
    email: /^[a-zA-Z0-9_-]+@[a-zA-Z0-9_-]+(\.[a-zA-Z0-9_-]+)+$/,
    idCard: /^[1-9]\d{5}(18|19|20)\d{2}((0[1-9])|(1[0-2]))(([0-2][1-9])|10|20|30|31)\d{3}[0-9Xx]$/,
    phone: /^1(3|4|5|6|7|8|9)\d{9}$/,
    password_1: /^[a-zA-Z]\w{5,17}$/,
    password_2: /^(?=.*\d)(?=.*[a-z])(?=.*[A-Z])[a-zA-Z0-9]{8,10}$/,
    password_3: /^(?=.*\d)(?=.*[a-z])(?=.*[A-Z]).{8,10}$/,

}